{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"45aca130-7c64-5826-8262-d3140896e61f","excerpt":"The focus of this site is to read and understand content. I started to think about what other sites and tools users interact with regularly. Then it hit me. I’d…","html":"<p>The focus of this site is to read and understand content. I started to think about what other sites and tools users interact with regularly.</p>\n<p>Then it hit me.</p>\n<p>I’d been reading loads of documentation from React, Gatsby, Mozilla docs, and <em>learning</em> for the past few months. Well, the goal for users that come to my site is to read and learn, so I’ve optimized this site for reading content.</p>\n<p>I’ve made the typography straightforward with large headings in a Sans Serif, that I’ve paired with a nice serif font. It’s amazing what a little CSS can do to really make a site shine. <a href=\"https://perfectmotherfuckingwebsite.com/\">Perfect Motherfucking Website</a></p>\n<p>I chose a side navigation because I wanted users to be able to explore different projects quickly and easily, instead of painstakingly going back to the project page, and locate the next project.</p>\n<p>I added a sidebar navigation, which you will commonly see in documentation sites. This is to allow users to move from project to project and have a clear sense of where they are located in the website at any given moment. It provides a clearer flow from page to page, instead of a fragmented experience while jumping back and forth between pages.</p>","frontmatter":{"title":"Tylerbenning.com","date":"January 01, 2016"}}},"pageContext":{"slug":"/personal-projects/tylerbenning-website/tylerbenning-website/","previous":{"fields":{"slug":"/personal-projects/all-contributors/all-contributors/"},"frontmatter":{"title":"All Contributors"}},"next":{"fields":{"slug":"/work-projects/ibm-loss-event-entry/"},"frontmatter":{"title":"Loss Event Entry"}}}}