{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"7db06e74-c664-5864-9877-0a6948147df7","excerpt":"At Top Hat, we’re in higher education. Higher education works in semesters. So we work in semesters. Each semester we have something called Engineering week…","html":"<p>At Top Hat, we’re in higher education. Higher education works in semesters. So we work in semesters.</p>\n<p>Each semester we have something called Engineering week. Engineering week is the time that everyone stops doing product based sprint work and focuses on a list of projects proposed and pitched by engineers.</p>\n<p>I have a dinky metaphor to share that I stole from the Eng leads. Say you’re in a forest chopping trees, but you never have time to sharpen your axe because you’re always chipping trees. Engineering week is the time to stop and sharpen your axe.</p>\n<p>This year in the winter semester, I pitched, planned, and led my own engineering week project, notably titled FE4 Prototyping . I pitched it as a chance to use our component library to build simple front-end prototypes (and as a bonus become best friends with me for a week 👬).</p>\n<p>A senior developer Jeremy jumped at the chance to be my best friend, and took a chance on the first design led Engineering week project. I estimated t-shirt sizes for the project and mapped out different projects that could be worked on, big and small.</p>\n<p><a href=\"https://medium.com/radius-engineering/project-estimation-through-t-shirt-size-ea496c631428\">Project Estimation Through T-Shirt size – Radius-Engineering – Medium</a></p>\n<p>Jeremy and I settled on a simple project to set up a create-react-app and use our front-end library to build an improved course lobby. I’d lead the design, and also implement it with Jeremy’s coaching.</p>\n<p>I did a bit of research to understand the data behind how the lobby was used. After a quick request to the <code class=\"language-text\">#analytics</code> Slack channel, I found some useful data on how many courses users have.</p>\n<p>[img here]</p>\n<p>It turns out lots of users have >4 courses, so I thought it might be nice to improve the UI with a list view that users could toggle to. I wanted to tighten up some other UI details while I was at it, and add some other helpful links to other Top Hat resources that often get missed by others.</p>\n<p>Jeremy spent the first day setting up <code class=\"language-text\">create-react-app</code> with our front-end library. There were hiccups along the way. While Jeremy showed me how to set up my dev environment, I wrote up a ReadMe for others to use.</p>\n<p>I spent the next couple of days piecing together my design, getting coaching and mentoring from Jeremy along the way.</p>\n<p>We investigated other more complex projects, but made sure to finish the week with a tangible thing that we’d built.</p>\n<p>By the end of the week we had another team set up and use the front-end prototyping app for their own project!</p>","frontmatter":{"title":"Front-End Prototyping","dateRange":"Nov 2018"}}},"pageContext":{"slug":"/work-projects/top-hat-eng-week/","previous":{"fields":{"slug":"/work-projects/top-hat-ux-quickwins/"},"frontmatter":{"title":"UX Quickwins on Mobile"}},"next":{"fields":{"slug":"/work-projects/paddle-motivations-assessment/"},"frontmatter":{"title":"Motivations Assessment"}}}}