{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"69464c01-15ee-5ef8-977f-869b68bb40f3","excerpt":"Panda’s Rock my fucking socks Pandas are really sweet. Here’s a video of a panda eating sweets. About Me\nProduct design is what I do at work everyday. Recently…","html":"<h2>Panda’s Rock my fucking socks</h2>\n<p>Pandas are really sweet.</p>\n<p>Here’s a video of a panda eating sweets.</p>\n<p>About Me\nProduct design is what I do at work everyday. Recently, I became interested in Javascript, React, and I built this site with Gatsby to boot. I think stories are an important part of design, and are what help people think on the same wavelength. This website is a place to share some of my own stories.</p>\n<h3>Humble Beginnings</h3>\n<p>I grew up in the <a href=\"\">boonies</a> in a farmhouse and had too much time to kill. When I was 7, my brother taught me how to use our family computer. I quickly discovered that computers were magical, and that I could harness these powers. I started playing games like Doom, Command &#x26; Conquer, Warcraft, and SimCity daily. I learned to download music on Napster and burn mixed CDs for my Walkman to impress friends at school. My friends’ parents started asking me to fix their computers, and I even made a bit of money doing it. I learned to record music, make videos, and how to play around with Photoshop. While not a child programmer prodigy, I was a bit of computer whiz.</p>\n<p>One day, my brother taught me about HTML. He showed me that if you write in a notepad file and save it with <code class=\"language-text\">.html</code> at the end of it, that the computer recognizes it as a web page. A couple of inline styles and anchor tags later, and my Dragon Ball Z drawings and MS paint renderings soon materialized into a homemade DBZ fan page (which unfortunately didn’t survive 2004).</p>\n<p>A few things have happened from now since then (namely Myspace, bad haircuts, puberty, university, a career) but I still get lost inside my computer tinkering around and learning new ways to conjure things onto the screen.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">SUM Stuff goes here</code></pre></div>\n<p>🎨🖥✨</p>\n<p><img src=\"http://unsplash.it/1024/760?random\" alt=\"User flow\"></p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/4n0xNbfJLR8\" frameborder=\"0\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><a href=\"https://www.gatsbyjs.org/tutorial/part-one/#deploying-a-gatsby-site\">Gatsby Building Blocks</a></p>\n<h2>Table</h2>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Stuff</th>\n<th align=\"left\">Other stuff</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\">stuff1</td>\n<td align=\"left\">Other stuff 1</td>\n</tr>\n<tr>\n<td align=\"left\">stuff2</td>\n<td align=\"left\">Other stuff 2</td>\n</tr>\n</tbody>\n</table>","frontmatter":{"title":"Sweet Pandas","date":"August 10, 2017"}}},"pageContext":{"slug":"/hello-world/","previous":null,"next":{"fields":{"slug":"/my-second-post/"},"frontmatter":{"title":"My Second Post!"}}}}