{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"f32364fd-b7cd-52b0-9c2e-8e8d1705793b","excerpt":"My Kid Years","html":"<h2>My Kid Years</h2>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">      I grew up in the boonies in a farmhouse and had too much time to kill.\n      When I was 7, my brother taught me how to use our family computer. I\n      quickly discovered how magical computers can be.\n\n      I started playing games like Doom, Command &amp; Conquer, Warcraft, and\n      SimCity daily. I learned to download music and burn mixed CDs to\n      impress friends at school. My friends’ parents started asking me to\n      fix their computers, and I even made a bit of money doing it. I\n      learned to use audio interfaces to record music, DV cameras to make\n      videos, and how to play around with graphics in Photoshop. I wasn’t a\n      child prodigy programmer, but I was a bit of computer whiz that could\n      learn new tools quick.\n\n      One day, my brother taught me about HTML. He showed me that if you\n      write in a notepad file and save it with &lt;code&gt;.html&lt;/code&gt; at the\n      end, that the computer recognizes it as a web page. A couple of inline\n      styles and anchor tags later, and my Dragon Ball Z drawings and MS\n      paint renderings soon materialized into a homemade DBZ fan page.{&#39; &#39;}\n\n      A few things have happened from now since then (namely Myspace, bad\n      haircuts, puberty, university, a career) but I still get lost inside\n      my computer tinkering around and learning new ways to conjure things\n      onto the screen.</code></pre></div>","frontmatter":{"title":"Portfolio Site","dateRange":"Dec 2018 - Present"}}},"pageContext":{"slug":"/about/kid-years/","previous":null,"next":{"fields":{"slug":"/personal-projects/tylerbenning-website/tylerbenning-website/"},"frontmatter":{"title":"Portfolio Site"}}}}