{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"a0a8535d-28da-55c6-bd9e-e73046d3be5d","excerpt":"I’ve worked with Paddle since early 2016, when the company had just began. I helped them launch their first self-assessment tool, and continued to consult with…","html":"<p>I’ve worked with Paddle since early 2016, when the company had just began. I helped them launch their first self-assessment tool, and continued to consult with them in my spare time over the coming years. I’ve worked on everything from product design, to conference banners, to pitch decks with the team. We’ve developed a great relationship over the years.</p>\n<p>In late 2018, Pat the CEO, took me out for a beer and enlisted my help for a new product they wanted to work on, which would help promote internal mobility at large enterprise companies. The product was still in its infancy and they needed help to turn a vision and a bit of research into a product.</p>\n<p>I got ready to put my facilitator hat on, and started preparing to kick off a 3 day problem discovery workshop.</p>\n<p><strong>Three Days to Discover</strong>\nThe team had already done some preliminary research with customers, employees, and managers to understand how internal mobility and careers at large companies worked. We used this qualitative data to make a user journey map.</p>\n<p>[JOURNEY MAP HERE]</p>\n<p>Since the product was still in its nascency, we did an activity to articulate a a vision statement to guide to the team as we moved forward.</p>\n<p>[Vision IMG]</p>\n<p>On this journey map we identified high and low level problems that employees and managers might face when looking at internal movements. We diverged to condense these problems into grouped themes.</p>\n<p>[GROUPED THEMEs]</p>\n<p>We spent the next session working on different solutions for these problems. At IBM, I’d learned an exercise called “big ideas” which are a helpful way to articulate solutions that weren’t too feature driven.</p>\n<p>[IMAGES HERE]</p>\n<p>After voting on our favourite ideas, we started sketching out bigger ideas on our own. This lead to a smattering of good ideas that we could continue to reference as the product progressed. We still have this backlog of ideas posted up in the office. If you work on a product and you keep circling back on a similar idea, it’s usually a good sign that it might be a promising feature for your product. Sometimes you just have to sit back and listen.</p>\n<p>[IMAGES]</p>\n<p>After we had worked through a good storyboard (thanks to AJ&#x26;Smarts helpful hacks!), I took the designs away and started to create hifi designs that we could use to test with customers.</p>\n<p><strong>User Testing</strong>\nThe worst thing you can do is think of an idea and build the whole product without talking to any users or customers. One of the other team members Ankur took the lead on user testing and getting customer feedback.</p>\n<p>After talking to some customers, we saw a need that we could fill with one of our previous ideas “Internal Roles Board”. In this idea, users could discover and learn about different roles that existed in the company, then eventually apply to jobs in these roles at the right time. It fit in perfectly with the other ideas we had, but allowed for a better end-to-end experience that felt like a complete enough MVP.</p>\n<p><strong>UI Design</strong>\nBefore I got to involved in building out UI mocks, I wanted to make sure the developers and I were on the same page, so we could build the UI efficiently using a shared system.</p>\n<p>I found out the the developers had made some decisions around front end architecture. We would use a blended Design System that took advantage of Semantic UI for major components. I had some flexibility to modify Type, Colors, and icons. We would build some simple components on our own, and implement Styled Components to customize some semantic UI components.</p>\n<p><a href=\"https://www.styled-components.com/\">styled-components</a></p>\n<p>With this in mind, I worked on a couple of iterations building out some simple UI concepts. I passed the assets off in Zeplin for the developers to build.</p>\n<p><strong>Launch</strong>\nWe’re still in the early phases of launching it with one of their current customers. We meet weekly to talk about progress, user adoption, UI fixes, iterative work, and to prioritize what to work on next.</p>","frontmatter":{"title":"Career Path Explorer","dateRange":"Nov 2018 - Feb 2019"}}},"pageContext":{"slug":"/work-projects/paddle-explore-roles/","previous":{"fields":{"slug":"/work-projects/paddle-motivations-assessment/"},"frontmatter":{"title":"Motivations Assessment"}},"next":null}}