{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"b80cc8d7-f328-5ba7-a33a-77dbaa0bf1a0","excerpt":"My friend from work Jake has pioneered the open source initiative at work, and has been getting more involved in different projects and communities. He’s the…","html":"<p>My friend from work Jake has pioneered the open source initiative at work, and has been getting more involved in different projects and communities. He’s the guy that pops up at designer’s desks to ask for logos, UI mocks flag and coffee mug designs for sometimes-neat-ideas he’s stewing over. This wasn’t the first time Jake has asked me for a favour, and likely won’t be the last.</p>\n<p><strong>Jake:</strong> Hey Tyler, wanna do a logo for something. Check it.\n<a href=\"https://github.com/all-contributors\">All Contributors · GitHub</a></p>\n<p><strong>Tyler:</strong> Yeah, okay. I’ll sketch a couple ideas and wrap something up tomorrow night. I’m leaving for vacay at the end of the week, so I’ll see if I can pump out some quick ideas before I go.</p>\n<p>What can I say? I’m a sucker for enthusiasm.</p>\n<p>After work, I lazily browsed the repo, scrawled some shapes in my notebook, and made a few shitlogos that felt uninspired and weren’t very good. I called it a night.</p>\n<p>Then, I actually <strong>read</strong> about the project, and realized it was a pretty neat idea that already had a good amount of traction. Bring everyone and their contributions into GitHub’s open source community. Get all hands on deck for open source projects, and motivate more people across different disciplines to contribute. Lower the barriers for adding contributors. Leave no contributor behind!</p>\n<p>Wait. I actually love this idea.</p>\n<p>Feeling refreshed, I went through another quick round of designs about an hour before hopping on a flight to Costa Rica. I quickly sent a mock of ~10 logos to Jake. Because it was 3AM, I guess Jake wasn’t awake, so I pulled the trigger and sent an SVG of what I thought worked best. I knew I wouldn’t have a laptop on vacation, and sometimes you’ve just gotta go with your gut. My Uber was downstairs and I had to get going.</p>\n<p>For me, the logo pays homage to the ✨ emoji that the project owner Kent Dodds had used on the project since it started. We wanted to build on it, but add more flair and “revolutionary” symbolism ;).</p>\n<p>I had a bit of time to think while sipping Imperial lagers on the beach. I’d been doing some research on open source communities for a work project, and I decided that I wanted in.</p>\n<p><strong>Tyler:</strong> I want to get more involved with the project. Let’s chat when I’m back.</p>\n<p><strong>Jake:</strong> Right-o! Chat ya when you’re back.</p>\n<p>The following weekend I sat down with Jake and got him to explain All Contributors to me as simply as possible. He told me about the existing project, and the bot that he’d built to add contributors to the ReadMe page of your repo. I try to get people to repeat things and teach me a concept until it’s simple enough for anyone to grasp. Then I repeat it back to them to check if it makes sense.</p>\n<p>After the brain dump, I took this information and wrote a draft of content for a homepage. Since it’s a marketing page, the goal is to concisely teach users how it works, and then them to install the Github Bot. Simple marketing magic.</p>\n<p>A few hours later I had a Sketch mockup finished, so I sent it around the All Contributors Slack group to get some feedback. Next day I cloned the website repo, and coded the page directly inside the Docusaurus app. I made a pull request, got it reviewed, and a few days later the site was up.</p>\n<p>Check out the project, tell your friends, and try out the bot on your own Open Source project!</p>","frontmatter":{"title":"All Contributors","date":"January 01, 2016"}}},"pageContext":{"slug":"/personal-projects/tyler-benning-website/all-contributors/","previous":null,"next":{"fields":{"slug":"/work-projects/ibm-loss-event-entry/"},"frontmatter":{"title":"Loss Event Entry"}}}}