{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"7db06e74-c664-5864-9877-0a6948147df7","excerpt":"What is Engineering Week? Each semester at Top Hat (semester instead of quarter), we have something called Engineering week. Engineering week is the time that…","html":"<h2>What is Engineering Week?</h2>\n<p>Each semester at Top Hat (semester instead of quarter), we have something called Engineering week. Engineering week is the time that everyone stops doing product based sprint work and focuses on a list of projects proposed and pitched by engineers.</p>\n<p>There’s a dinky metaphor floating around that describes what engineering week is all about –– which I stole from the Engineering leads. So, you’re in a forest chopping trees, but you never have time to sharpen your axe because you’re always too busy chopping trees. Engineering week is the time to stop and sharpen your axe.</p>\n<p>This year in the winter semester, I pitched, planned, and led my own engineering week project, notably titled <strong>FE4 Prototyping.</strong> I pitched it as a chance to use our component library to build simple front-end prototypes away from our monolithic architecture… and as a bonus you get to become best friends with me for a week 👬.</p>\n<p>A senior developer Jeremy jumped at the chance to be my best friend, and took a chance on the first design-led Engineering week project. I estimated <a href=\"https://medium.com/radius-engineering/project-estimation-through-t-shirt-size-ea496c631428\">t-shirt sizes</a> for the project and created a week long sprint worth of work.</p>\n<p>Jeremy and I settled on a simple project to set up a <code class=\"language-text\">create-react-app</code> that we would hook up to our front-end library to build an improved course lobby. I’d lead the design, and also implemented it with Jeremy’s coaching.</p>\n<h2>As Is Lobby</h2>\n<p>I came up with the idea that the Top Hat course lobby could be improved. It had been built and shipped, and not touched again. I thought it could use a minor facelift, and some general UI improvements.</p>\n<p><img src=\"images/current-lobbby.png\" alt=\"Existing Course Lobby\"></p>\n<p>I did a bit of quantitative research to understand how the lobby was being used. After a quick request to the <code class=\"language-text\">#analytics</code> Slack channel, I found some useful data on how many courses professors had in their course lobby.</p>\n<p><img src=\"images/data.png\" alt=\"Data\">\n<em>14% of professsors have more than four courses</em></p>\n<p>It turns out that ~14% of users have >4 courses. I thought it might be nice to improve the UI with a list view so users could skim through their courses easier than in a card view. I also thought it might be helpful to link to other Top Hat resources that often get missed by users, like the support documentation channels. To be honest, I drew some inspiration from Airtable’s Workspace area.</p>\n<p><img src=\"images/airtable.png\" alt=\"Airtable UI\"></p>\n<h2>Day 1 &#x26; 2</h2>\n<p>Jeremy spent the first day setting up <code class=\"language-text\">create-react-app</code> and hooking it up to our front-end library. There were hiccups along the way based on how our front end library was hosted. Meanwhile, I worked out final kinks of the design and wrote a ReadMe on how to set up the dev environment.</p>\n<p><img src=\"images/readme.png\" alt=\"Data\">\n<em>The repo’s ReadMe</em></p>\n<h2>Day 3 &#x26; 4</h2>\n<p>I spent time learning about state management in React and how it would help translate my grid and list view designs into code. We worked through how to build out the toggle switch and swap between the list view and grid view.</p>\n<p><img src=\"images/styled-components.png\" alt=\"Styled Components\"></p>\n<p>As a designer, I was immediately attracted to Styled Components, because of how familiar the syntax felt. I’d been a CSS whiz in my past life, and hopping into Styled Components was a breeze.</p>\n<h2>Day 5</h2>\n<p>Wrap up, and tie up loose ends. We finished up the project and did a retrospective on our process.</p>\n<h2>The Final Result</h2>\n<p><div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 50%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <div class=\"embedVideo-container\">\n            <iframe src=\"https://player.vimeo.com/video/321020847\" class=\"embedVideo-iframe\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n        </div>\n      <style>\n        .embedVideo-iframe {\n          border: 0\n        }\n      </style>\n          </div>\n          </div></p>\n<p>Overall, it was a positive experience collaborating with engineering at a closer level. It made me closely consider how I put together designs, and how I make compromises with my team members. It was a succesful week or learning, as well as empathy building.</p>","frontmatter":{"title":"Front-End Prototyping","dateRange":"Nov 26-30 2018"}}},"pageContext":{"slug":"/work-projects/top-hat-eng-week/","previous":{"fields":{"slug":"/work-projects/paddle-explore-roles/"},"frontmatter":{"title":"Career Path Explorer"}},"next":{"fields":{"slug":"/work-projects/top-hat-classroom/"},"frontmatter":{"title":"The iOS Classroom Experience"}}}}