{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"e4285b30-5150-562f-ae2d-c5c57c3da00f","excerpt":"OpenPages: Loss Event Entry (LEE) Problem Picture this. You manage a team of currency traders at a large bank and you find that one of your team members…","html":"<p>OpenPages: Loss Event Entry (LEE)</p>\n<h2>Problem</h2>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/8058f3f26913fea3b6a89a73344fe94a/3f5a1/salty_egg.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 75%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMB/8QAFwEAAwEAAAAAAAAAAAAAAAAAAAEEBf/aAAwDAQACEAMQAAABgik0dXC//8QAGRABAAMBAQAAAAAAAAAAAAAAAQACEhEy/9oACAEBAAEFAkqW2DlnRj73yf/EABcRAQADAAAAAAAAAAAAAAAAAAAREkH/2gAIAQMBAT8B1WX/xAAWEQEBAQAAAAAAAAAAAAAAAAAAEQL/2gAIAQIBAT8Bi6f/xAAbEAABBAMAAAAAAAAAAAAAAAAAAQIRISIxMv/aAAgBAQAGPwK9GNocyS8hCj//xAAcEAADAQACAwAAAAAAAAAAAAABESEAMUGBobH/2gAIAQEAAT8hsTTH2wx5gg2ZgM8d5JIfmMRAIe//2gAMAwEAAgADAAAAEMgv/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARIf/aAAgBAwEBPxARwyusv//EABgRAAIDAAAAAAAAAAAAAAAAAAABESFR/9oACAECAQE/EFoktI//xAAcEAEBAAIDAQEAAAAAAAAAAAABEQAxIWGBQeH/2gAIAQEAAT8QRswtDR5g4a7R5C/RHFM3BKk6zThoVp3lEYcnjGIYES7/ACZ//9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Chinese Salty Egg\"\n        title=\"\"\n        src=\"/static/8058f3f26913fea3b6a89a73344fe94a/f8fb9/salty_egg.jpg\"\n        srcset=\"/static/8058f3f26913fea3b6a89a73344fe94a/e8976/salty_egg.jpg 148w,\n/static/8058f3f26913fea3b6a89a73344fe94a/63df2/salty_egg.jpg 295w,\n/static/8058f3f26913fea3b6a89a73344fe94a/f8fb9/salty_egg.jpg 590w,\n/static/8058f3f26913fea3b6a89a73344fe94a/85e3d/salty_egg.jpg 885w,\n/static/8058f3f26913fea3b6a89a73344fe94a/d1924/salty_egg.jpg 1180w,\n/static/8058f3f26913fea3b6a89a73344fe94a/9452e/salty_egg.jpg 1770w,\n/static/8058f3f26913fea3b6a89a73344fe94a/3f5a1/salty_egg.jpg 2048w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Picture this. You manage a team of currency traders at a large bank and you find that one of your team members accidentally converted $100k USD into Chilean pesos instead of Mexican pesos.  By the time they figured out the error and traded it back, the market shifted and a $5000 loss occurred. At this point, it’s your team’s responsibility to report a loss event to the risk management team. What do you do next?</p>\n<p>Reporting loss events at banks is tough. In an ideal world, everyone in a company would work together to report loss events. There are communications problems, team silos, and difficult pieces of legacy software that prevent employees from working together and submitting these events.</p>\n<p>Our customers needed an elegant solution for infrequent and non-users of OpenPages to submit loss events quickly and easily, so that they could improve risk management practices across the business.</p>\n<h2>My Role</h2>\n<p>I was the team lead and user experience designer.</p>\n<p>Located in Toronto, our team worked remotely with the OpenPages product management and development teams (located in Massachusetts). I collaborated on research, lead workshops for problem discovery, user journey mapping, sketching sessions, usability testing, and project management through ’til the final stages of development. As a team we were usually juggling multiple projects at once. Loss Event Entry is 1 of about 8 projects I worked on with the IBM OpenPages team. We worked on this project over 2-3 months from initial scope to completion.</p>\n<h2>Research</h2>\n<p>Dylan, our user researcher and I lead design activities with teams at two separate “Big Five Banks” in Toronto. We facilitated journey mapping exercises to map out the loss event process in different teams. We learned a lot from the study, but the participants were surprised to find that they learned more about their own processes throughout the exercise!</p>\n<p>There were a few emergent themes:</p>\n<ul>\n<li><strong>Ad Hoc Processes</strong>\nEvents are documented and submitted in ad-hoc processes, which change across the business.</li>\n<li><strong>Collaboration</strong>\nIt’s necessary for different actors to work together when collecting information about a loss event.</li>\n<li><strong>Usability matters</strong>\nWe found an internal tool that was built to capture loss events, but was failing to do the job properly because it was over 100 inputs long, with no helper text, and 90% of the fields were mandatory. <em>Nobody used it.</em></li>\n</ul>\n<h2>Design &#x26; Development</h2>\n<p>As a designer, I believe it can be important to ideate without major constraints to understand an ideal user-centred solution, and then scale back based on constraints. It’s important to expand the teams understanding of what’s possible, but also take a balanced perspective to come to a good compromise.</p>\n<p>We learned what our users needed, but we also needed to decide what was the essential job that our product could fulfill, and what was extra. To understand the technical constraints, I worked with the development team to get a sense of what types of information we could access to via their REST API.</p>\n<p>I put together a user journey and low fidelity mocks of the ideal solution. We worked with our Product Manager Bob, and our technical leads to undergo various rounds of iteration and feedback to come to a good solution.</p>\n<h2>Working Within Constraints</h2>\n<p>We stripped down the collaborative features, and built a form that users could work through incrementally. We made only absolutely necessary fields required, and added an area for helpful tool tips. We used progressive disclosure, so that users could work through bitesized chunks of data input, and skip areas that didn’t apply to their type of loss event.</p>\n<p>Our UI designer Jasmine picked a colour scheme, type scale, and spacing that would work well to balance that information architecture but also adhere to the IBM Design Guide. She worked closely with our front end developer Susan to build a simple front end prototype in Angular, which we brought back to customers to perform user testing. We found usability improvements and workflow improvements that we were able to get into the production build of the application.</p>\n<p>The project was finished with a few weeks to spare, so we had the appropriate time to test and get extra UI polish and copywriting changes into the final version.</p>","frontmatter":{"title":"Loss Event Entry","date":"January 01, 2016"}}},"pageContext":{"slug":"/work-projects/bobbles/","previous":null,"next":{"fields":{"slug":"/personal-projects/all-contributors/all-contributors/"},"frontmatter":{"title":"All Contributors"}}}}