{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"45aca130-7c64-5826-8262-d3140896e61f","excerpt":"How I Designed This I approached this project similarly to how I approach most design projects. Figure out who the users are and their tasks. Well, based on the…","html":"<h2>How I Designed This</h2>\n<p>I approached this project similarly to how I approach most design projects. Figure out who the users are and their tasks.</p>\n<p>Well, based on the conversations I’ve had around my last portfolios it’s probably:</p>\n<ul>\n<li>Recruiters</li>\n<li>Hiring managers</li>\n<li>Other designers</li>\n<li>Mom ❤️</li>\n</ul>\n<p>What do I expect people to use this site for?</p>\n<ul>\n<li>Learning</li>\n<li>Reading</li>\n<li>Skimming</li>\n<li>Judging Me 🧐</li>\n</ul>\n<p><strong>Optimizing for Reading &#x26; Learning</strong></p>\n<p>Okay, so users are supposed to spend time reading and learning on this site. What kinds of sites are optimized for reading? Well, I’d been reading and learning from loads of documentation sites like React, Gatsby, Mozilla docs, so I looked at their patterns. Documentation sites usually have clear an straightforward navigation to get guide users through content.</p>\n<p>I sketched out a few simple layouts on paper, structured out my content, then started mocking them up in Sketch.</p>\n<p>I chose a sidebar navigation that listed out my different project write-ups. When a user is done reading a writeup, they can hop over to the next item on the sidebar. There’s no need to go back to the main project page, scroll down, and find the next one. Sure, it only really saves a quick click here and there, but it adds up when you’re short on time and trying to flip between write-ups. I also added keyboard navigation for lazy people and power users.</p>\n<p><strong>Visual Design</strong></p>\n<p>I did some photoshop magic on my hero image and added in some fun mixed media illustrations that I pulled from a pattern on my favourite shirt. I grabbed my personal logo I’d made a few years ago and plunked the SVG into my Sketch file. Nothing special. Just enough to add some fun.</p>\n<p><strong>Typography</strong></p>\n<p>Since this is a content site, I made the typography straightforward with large headings in IBM Plex Sans, that I paired with Google Font’s PT Serif. It’s amazing what a little CSS can do to really make a site shine. <a href=\"https://perfectmotherfuckingwebsite.com/\">Perfect Motherfucking Website</a></p>\n<h2>“How I Built This”</h2>\n<p>Almost a decade ago, I’d spent a good deal of time learning HTML/CSS, Javascript, and a bit of PHP. I’d built some Wordpress site, and a couple of other rudimentary sites, before diving headfirst into a career in design, leaving coding (mostly) behind.</p>\n<p>In late 2018, I decided I’d test the waters and look at how front end tools have evolved. I started learning git, set up a Github, and enrolled in a Javascript course at HackerYou. I started compiling a huge list of resources and used this roadmap as a guide on what to learn. It turns out there’s a good amount of resources for designers who want to learn more code.</p>\n<p><a href=\"https://github.com/kamranahmedse/developer-roadmap\">GitHub - kamranahmedse/developer-roadmap: Roadmap to becoming a web developer in 2019</a></p>\n<p>It’s important to have projects while learning. After I’d completed a few jQuery assignments (project 1, project 2) for my HackerYou course, I wanted to dive into React and figure out what all the buzz was about.</p>\n<p>I started taking some online tutorials from Wes Bos and Meng To to get a feel for React. I read through all the Gatsby docs, and decided to use Gatsby as my tool of choice. I installed Styled Components and Prettier, and started structuring out my content in markdown files. I picked up just enough GraphQL to grab data from my markdown files, and get my site up and running on Github Pages.</p>\n<p>I’m using LightHouse to check features.\nI’m still working on accessibility. It’s an important facet of design and development that I’m really curious about.</p>\n<h2>Content Writing</h2>\n<p>I write everything using Bear. I found it a few months back, and write all my work and personal notes in it. There’s a handy feature where you can copy everything as markdown, so I just paste everything I write into my markdown files on the site.</p>\n<p>Sure, there are more elegant CMS’, but I don’t mind updating my markdown files manually and pushing them to Github to deploy my site.</p>\n<h2>Feedback</h2>\n<p>It’s been a wild ride getting this thing going, if you’re curious about the source code for this site, check the project out on Github. I always appreciate feedback on how I can improve the quality of this site.</p>","frontmatter":{"title":"Portfolio Site","dateRange":"Dec 2018 - Present"}}},"pageContext":{"slug":"/personal-projects/tylerbenning-website/tylerbenning-website/","previous":{"fields":{"slug":"/personal-projects/all-contributors/all-contributors/"},"frontmatter":{"title":"Launching an Open Source Brand"}},"next":{"fields":{"slug":"/work-projects/ibm-loss-event-entry/"},"frontmatter":{"title":"Loss Event Entry"}}}}