{"data":{"site":{"siteMetadata":{"title":"Tyler Benning Product Designer","author":"Tyler Benning"}},"markdownRemark":{"id":"069101e2-4f5f-5866-965f-19531388872d","excerpt":"UX Quick Wins As the lead designer for iOS and Android, I’d inherited UI that didn’t feel like it belonged to the same family as our web product. The typography…","html":"<h1>UX Quick Wins</h1>\n<p>As the lead designer for iOS and Android, I’d inherited UI that didn’t feel like it belonged to the same family as our web product. The typography, colours, and UI pattern were messy and did not follow a prescribed system. There were lots of small inconsistencies and interaction design issues.</p>\n<p>[IMG HERE]</p>\n<p>As a lean mobile team, we had other priorities to stabilize crash rates, keep up with new features being introduced to the product, and keep up with new OS releases. Sprint after sprint, design kept getting put on the back burner as “something we’ll do once we finish up this other important work”.</p>\n<p>After a few frustrating months of trying to get buy in for a UI refresh, we settled on an alternative approach that we now call <strong>UX Quick Wins.</strong> Over the course of a year and a half, we slowly chipped away at design debt while continuing to do other important work.</p>\n<h2>The Process</h2>\n<ol>\n<li>Notice something wrong in the app</li>\n<li>Create a JIRA ticket to fix it</li>\n<li>Create a design, show it to the developers and other designers, and iterate on the design based on feedback</li>\n<li>Attach a new design to the ticket</li>\n<li>Get it bundled into the next sprint</li>\n<li>Repeat</li>\n</ol>\n<p>Another infrastructural piece that was missing was common tooling between design and development. We weren’t speaking the same language, and I noticed we were spending a lot of time determining colours, typography, and more.</p>\n<p>At Top Hat, every semester we have one week called <strong>Engineering Week</strong>. During this week, the devs have the opportunity to stop chopping down trees, and instead sharpen their axes and work on infrastructure. During this week I worked closely with the mobile developers to set up a proper design system of styles that we would build from. This would reduce the effort when passing off designs.</p>\n<p>We created rules around</p>\n<ul>\n<li>Spacing (8pt grid system with 16pt margins)</li>\n<li>Type scale</li>\n<li>Colour palette</li>\n<li>Icon system</li>\n</ul>\n<p>To enforce this system we used Zeplin to create the library of styles, and drafted a ReadMe in Github. I even downloaded Xcode and Android Studio to dig into their styles and patterns and remove unnecessary colours, icons. After engineering week, I now had the ability to pull branches of work, run a simulator, demo, and give feedback to the developers when needed.</p>\n<p>After this system was put in place, our UX Quick Wins started rapidly picking up speed.</p>\n<ul>\n<li>Log In Flow</li>\n<li>Join Course Flow</li>\n<li>Course Lobby</li>\n<li>Empty States and Illustrations</li>\n<li>Classroom answered/unanswered + tree state</li>\n<li>Gradebook</li>\n<li>Navigation titles + Icons</li>\n</ul>\n<p>While we’re still working on UX quick wins and it’s not over yet. Here are some examples of improvements we’ve been able to make over the past year, all while stabilizing the infrastructure, reducing crash rates, and keeping up with projects from other teams.</p>","frontmatter":{"title":"UX Quickwins on Mobile","date":"January 01, 2019"}}},"pageContext":{"slug":"/top-hat-ux-quickwins/","previous":{"fields":{"slug":"/paddle-motivations-assessment/"},"frontmatter":{"title":"Motivations Assessment"}},"next":null}}